{
  "intents": [
    {
      "tag": "self_name",
      "patterns": [
        "pratham",
        "pratham chauhan"
      ],
      "responses": [
        "That's me! I'm a chatbot designed to answer questions about Pratham's resume. What would you like to know about his skills, projects, or experience?",
        "You've come to the right place! I can tell you all about Pratham. Feel free to ask me anything about his professional background.",
        "Yes, that's who I'm here to talk about. How can I help you learn more about Pratham?"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "hello",
        "hey",
        "hi",
        "good morning",
        "good afternoon",
        "whats up",
        "how are you"
      ],
      "responses": [
        "Hello! I'm a chatbot designed to answer questions about Pratham Chauhan's resume. How can I help?",
        "Hi there! Ask me anything about Pratham's skills, projects, or experience."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "goodbye",
        "bye",
        "see you later",
        "take care"
      ],
      "responses": [
        "Goodbye! Have a great day!",
        "Feel free to reach out to Pratham directly for more information. Farewell!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "thank you",
        "thanks",
        "appreciate it"
      ],
      "responses": [
        "You're welcome! Is there anything else I can help you with?",
        "Glad I could help!"
      ]
    },
    {
      "tag": "bot_identity",
      "patterns": [
        "who are you",
        "what are you",
        "are you a bot"
      ],
      "responses": [
        "I am a chatbot created by Pratham Chauhan to help answer questions about his skills and experience. I am part of his ChatMinds project: https://github.com/chauhan-pratham/Chat-Minds"
      ]
    },
    {
      "tag": "availability",
      "patterns": [
        "are you available",
        "when can you start",
        "job availability"
      ],
      "responses": [
        "Pratham is actively seeking a challenging software development role, either as a full-time position or a long-term internship. He is available to start immediately and is flexible with start dates."
      ]
    },
    {
      "tag": "links",
      "patterns": [
        "github",
        "linkedin",
        "github",
        "profiles",
        "link to your work",
        "repository"
      ],
      "responses": [
        "Of course. Here are the links to Pratham's key professional profiles:\n\n-<b>GitHub:</b> <a href='https://github.com/chauhan-pratham' target='_blank'>Link</a>\n- <b>LinkedIn:</b> <a href='https://www.linkedin.com/in/chauhan-pratham/' target='_blank'>Link</a>"
      ]
    },
    {
      "tag": "unknown",
      "patterns": [
        "help",
        "what can you do",
        "i don't understand"
      ],
      "responses": [
        "I can only answer questions about Pratham's resume. Try asking about his skills, projects, or internships.",
        "I'm sorry, I don't have an answer for that. Please ask me something related to Pratham's professional background."
      ]
    }
  ]
}